app/views/users/all.html.erb

<% @otherUsers.each do |u| %>
	<% obj = Follower.find_by(user_id: @thisUser.id, following: u.id)%>
---
SELECT  "followers".* FROM "followers" WHERE "followers"."user_id" = ? AND "followers"."following" = ? LIMIT ?  [["user_id", 302], ["following", 303], ["LIMIT", 1]]