app/views/users/space.html.erb

SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = ?  [["user_id", 232]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 223]]
---
        <%allTweets = @user.tweets%>
         <% @user.followers.each do |f| %>
         <% tweets = Tweet.where(user_id: f.following)%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 223], ["LIMIT", 1]]
---
      <article>
        <h2 class="title"><%=User.find_by(id: tweet.user_id).name%></h2>