app/views/publishers/index.html.erb

 	<p>From <%=p.name %>:</p>
 	<% news = News.where(publisher_id: p.id)%>
---
SELECT "news".* FROM "news" WHERE "news"."publisher_id" = ?  [["publisher_id", "2"]]