app/controllers/followers_controller.rb

INSERT INTO "followers" ("user_id", "following") VALUES (?, ?)  [["user_id", 266], ["following", 264]]
---
  	def create
    	f = Follower.new
    	f.user_id = params["user_id"]
    	f.following = params["following"]
    	if f.save