app/controllers/publishers_controller.rb

SELECT "publishers".* FROM "publishers"
---
	def index
		@publishers = Publisher.all