app/controllers/sessions_controller.rb

  def create
    user = User.find_by(account: params["account"])
---
SELECT  "users".* FROM "users" WHERE "users"."account" = ? LIMIT ?  [["account", "account1"], ["LIMIT", 1]]