app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new
    @tweet.user_id = params["user_id"]
    @tweet.content = params["message"]
    @tweet.time = Time.new.inspect
    if @tweet.save
---
INSERT INTO "tweets" ("user_id", "content", "time") VALUES (?, ?, ?)  [["user_id", 224], ["content", "sss"], ["time", "2017-05-20 02:37:48 -0500"]]