app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 264], ["LIMIT", 1]]

  def edit
      @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 264], ["LIMIT", 1]]

  def all
      @thisUser = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 264], ["LIMIT", 1]]

  def create
    @user = User.new
    @user.name = params["name"]
    @user.password = params["password"]
    @user.account = params["account"]
    @user.gender = params["gender"]
    if @user.save
---
INSERT INTO "users" ("account", "password", "name", "gender") VALUES (?, ?, ?, ?)  [["account", "llljglwt"], ["password", "lwt12345"], ["name", "lwt"], ["gender", "male"]]

  def update
    user = User.find_by(id: params["id"])
    user.password = params["password"]
    user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 264], ["LIMIT", 1]]
UPDATE "users" SET "password" = ? WHERE "users"."id" = ?  [["password", "lwt12345"], ["id", 264]]

  def space
      @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 223], ["LIMIT", 1]]